## pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series(data=[1,2,3,4], index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
myd= {'e':22,'f':33,'g':44,'h':565}

In [4]:
myd

{'e': 22, 'f': 33, 'g': 44, 'h': 565}

In [5]:
pd.Series(myd)

e     22
f     33
g     44
h    565
dtype: int64

In [6]:
myseries = pd.Series([1,2,3,4],['a','b','c','d'])

In [7]:
myseries

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
myseriestwo = pd.Series([1,0,9,4],['a','b','c','h'])

In [9]:
myseriestwo

a    1
b    0
c    9
h    4
dtype: int64

In [10]:
# merge series...it will give you NaN if the value of first series is not in series two

In [11]:
myseries + myseriestwo

a     2.0
b     2.0
c    12.0
d     NaN
h     NaN
dtype: float64

In [12]:
myseriestwo['a']

1

In [13]:
myseriestwo['c']

9

## data frame

In [14]:
from numpy.random import randn

In [15]:
randn(3,4)

array([[ 1.38431658, -0.66316409, -0.48261301, -1.50173921],
       [-0.46778638,  1.45079383, -0.03275379,  0.16003362],
       [-1.48856188,  0.23877591,  1.82029388, -0.40629158]])

In [16]:
mydata = randn(3,4)

In [17]:
mydata

array([[-0.74923369, -0.96052473, -0.74822378,  0.68811857],
       [-1.40474145, -0.00445792, -0.04553243,  0.63675346],
       [ 0.65720016,  0.24874916, -0.38383478, -0.70348366]])

In [18]:
myDataframe = pd.DataFrame(mydata,['R1','R2','R3'],['c1','c2','c3','c4'])

In [19]:
myDataframe

          c1        c2        c3        c4
R1 -0.749234 -0.960525 -0.748224  0.688119
R2 -1.404741 -0.004458 -0.045532  0.636753
R3  0.657200  0.248749 -0.383835 -0.703484

In [20]:
myDataframe['c1']

R1   -0.749234
R2   -1.404741
R3    0.657200
Name: c1, dtype: float64

In [21]:
myDataframe[['c1','c4']]

          c1        c4
R1 -0.749234  0.688119
R2 -1.404741  0.636753
R3  0.657200 -0.703484

## multiplication

In [22]:
myDataframe['c5']=  myDataframe['c1']* myDataframe['c3']

In [23]:
myDataframe

          c1        c2        c3        c4        c5
R1 -0.749234 -0.960525 -0.748224  0.688119  0.560594
R2 -1.404741 -0.004458 -0.045532  0.636753  0.063961
R3  0.657200  0.248749 -0.383835 -0.703484 -0.252256

## deleting a value

In [24]:
## we must to give axix

In [25]:
myDataframe.drop('c3',axis = 1,inplace=True)

In [26]:
myDataframe

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961
R3  0.657200  0.248749 -0.703484 -0.252256

## Dataframe in pandas

In [27]:
myDataframe.loc['R2']

c1   -1.404741
c2   -0.004458
c4    0.636753
c5    0.063961
Name: R2, dtype: float64

In [28]:
myDataframe.iloc[1]

c1   -1.404741
c2   -0.004458
c4    0.636753
c5    0.063961
Name: R2, dtype: float64

In [29]:
myDataframe.loc[['R1','R2'],['c4','c5']]

          c4        c5
R1  0.688119  0.560594
R2  0.636753  0.063961

In [30]:
myDataframe.loc[['R2'],['c4']]

          c4
R2  0.636753

## condtional selection in pandas

In [31]:
myDataframe

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961
R3  0.657200  0.248749 -0.703484 -0.252256

In [32]:
myDataframe > 0

       c1     c2     c4     c5
R1  False  False   True   True
R2  False  False   True   True
R3   True   True  False  False

In [33]:
myDataframe[myDataframe > 0]

        c1        c2        c4        c5
R1     NaN       NaN  0.688119  0.560594
R2     NaN       NaN  0.636753  0.063961
R3  0.6572  0.248749       NaN       NaN

In [34]:
myDataframe[myDataframe['c2'] > 0]

        c1        c2        c4        c5
R3  0.6572  0.248749 -0.703484 -0.252256

In [35]:
myDataframe[myDataframe['c5'] > 0]

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961

## Multiple condition in pandas

In [36]:
myDataframe

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961
R3  0.657200  0.248749 -0.703484 -0.252256

In [48]:
myDataframe[myDataframe['c4'] > 0]

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961

In [49]:
#use &

In [53]:
myDataframe[(myDataframe['c5'] > 0)  & (myDataframe['c4'] > 0)]

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961

In [51]:
#use or |

In [54]:
myDataframe[(myDataframe['c5'] > 0)  | (myDataframe['c4'] > 0)]

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961

In [55]:
myDataframe

          c1        c2        c4        c5
R1 -0.749234 -0.960525  0.688119  0.560594
R2 -1.404741 -0.004458  0.636753  0.063961
R3  0.657200  0.248749 -0.703484 -0.252256

In [56]:
mynewindex =['row1','row2','row3']

In [59]:
mynewindex

['row1', 'row2', 'row3']

In [60]:
myDataframe['mynewindex']=mynewindex

In [61]:
myDataframe

          c1        c2        c4        c5 mynewindex
R1 -0.749234 -0.960525  0.688119  0.560594       row1
R2 -1.404741 -0.004458  0.636753  0.063961       row2
R3  0.657200  0.248749 -0.703484 -0.252256       row3

In [66]:
myDataframe.set_index('mynewindex')

                  c1        c2        c4        c5
mynewindex
row1       -0.749234 -0.960525  0.688119  0.560594
row2       -1.404741 -0.004458  0.636753  0.063961
row3        0.657200  0.248749 -0.703484 -0.252256

In [67]:
myDataframe.set_index('mynewindex', inplace=True)

In [68]:
myDataframe

                  c1        c2        c4        c5
mynewindex
row1       -0.749234 -0.960525  0.688119  0.560594
row2       -1.404741 -0.004458  0.636753  0.063961
row3        0.657200  0.248749 -0.703484 -0.252256